EventSamples/ALERT.MLSensor.MailNew/mailman-events-00008.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2" xmlns:wsa="http://www.w3.org/2005/08/addressing">
  <soap:Header>Header</soap:Header>
  <soap:Body>
    <wsnt:Notify>
      <wsnt:NotificationMessage>
        <wsnt:Topic>ALERT.MLSensor.MailNew</wsnt:Topic>
        <wsnt:ProducerReference>
          <wsa:Address>http://www.alert-project.eu/MLSensor</wsa:Address>
        </wsnt:ProducerReference>
        <wsnt:Message>
          <ns1:event xmlns:ns1="http://www.alert-project.eu/" xmlns:o="http://www.alert-project.eu/ontoevents-mdservice" xmlns:r="http://www.alert-project.eu/rawevents-forum" xmlns:r1="http://www.alert-project.eu/rawevents-mailinglist" xmlns:r2="http://www.alert-project.eu/rawevents-wiki" xmlns:s="http://www.alert-project.eu/strevents-kesi" xmlns:sm="http://www.alert-project.eu/stardom" xmlns:s1="http://www.alert-project.eu/strevents-keui" xmlns:sc="http://www.alert-project.eu/socrates" xmlns:p="http://www.alert-project.eu/panteon" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.alert-project.eu/alert-root.xsd"  >
            <ns1:head>
              <ns1:sender>MLSensor</ns1:sender>
              <ns1:timestamp>1348472809821</ns1:timestamp>
              <ns1:sequencenumber>7</ns1:sequencenumber>
            </ns1:head>
            <ns1:payload>
              <ns1:meta>
                <ns1:startTime>1348472809821</ns1:startTime>
                <ns1:endTime>1348472809822</ns1:endTime>
                <ns1:eventName>ALERT.MLSensor.MailNew</ns1:eventName>
                <ns1:eventId>7</ns1:eventId>
                <ns1:eventType>Request</ns1:eventType>
              </ns1:meta>
              <ns1:eventData>
                <r1:message>
                  <r1:from><![CDATA[ervin at kde.org (Kevin Ottens)]]></r1:from>
                  <r1:date>Thu, 05 Jan 2006 11:32:13 +0200</r1:date>
                  <r1:subject><![CDATA[[Kde-hardware-devel] Offerring my help.]]></r1:subject>
                  <r1:content><![CDATA[Le Mercredi 4 Janvier 2006 18:29, Micha?l Larouche a ?crit :
> Note that I don't know anything yet about low-level system programming but
> I'll learn with the time.

Sure, I don't expect everybody to master how to deal with the low-level 
layers. Anyway we need people to write applications using Solid. In 
particular small helper applications will be important. The first one being 
surely the hardware browser that will help us as developers too. With the 
current version of libkdehw it's even possible to experiment and write small 
tools cloning lshal or hal-device-manager behavior (which are quite handy 
tools).

> My area of interests are the hardware and network integration. Also maybe
> work in collaboration with Plasma team.

You'll surely be interested in working on the future Plasma engine then. The 
library is not ready yet to build this engine, but in the mean time, it'd 
interesting to collect needs for Plasma applets. From here it'll be easier to 
know which information should be available or not through this engine (some 
of them might be overkill for applets).

Regards.
-- 
K?vin 'ervin' Ottens, http://ervin.ipsquad.net
"Ni le ma?tre sans disciple, Ni le disciple sans ma?tre,
Ne font reculer l'ignorance."
]]></r1:content>
                </r1:message>
              </ns1:eventData>
            </ns1:payload>
          </ns1:event>
        </wsnt:Message>
      </wsnt:NotificationMessage>
    </wsnt:Notify>
  </soap:Body>
</soap:Envelope>